IDENTIFICATION DIVISION.
PROGRAM-ID. AUDIT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 ROOT-A.
  05 GROUP-X.
    10 VALUE-X PIC 9.
01 ROOT-B.
  05 GROUP-X.
    10 VALUE-X PIC 9.
PROCEDURE DIVISION.
MAIN-PARA.
DISPLAY VALUE-X OF GROUP-X OF ROOT-A.
GOBACK.
