IDENTIFICATION DIVISION.
PROGRAM-ID. AUDIT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 ROOT-A.
  05 A PIC 9.
01 WRONG-GROUP PIC 9.
PROCEDURE DIVISION.
MAIN-PARA.
DISPLAY A OF WRONG-GROUP.
GOBACK.
