       IDENTIFICATION DIVISION.
       PROGRAM-ID. MINIMAL.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY 'HELLO'.
           STOP RUN.
