000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. EDGECASE.
000300 PROCEDURE DIVISION.
000400 MAIN-PARA.
000500     DISPLAY 'LONG-LINE-CONTENT-THAT-RUNS-ALL-THE-WAY-TO-SEVENTY-TIGNOREME
000600-    'WO-AND-BEYOND'.
000700     STOP RUN.
