identification division.
program-id. freeformat.
procedure division.
main-para.
    display 'hello' *> Begruessung, Rest der Zeile ist Kommentar
    stop run.
