       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPYREPL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY WSFIELDS REPLACING ==:TAG:== BY ==WS-FIELD==.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY 'HELLO'.
           STOP RUN.
