       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPYMISS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY NOSUCHBOOK.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY 'HELLO'.
           STOP RUN.
