       >>SOURCE FORMAT FREE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. INDENTDIR.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY "HELLO".
           STOP RUN.
