       IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTIMAIN.
       PROCEDURE DIVISION.
       MAIN-PARA.
           PERFORM INIT-PARA.
           CALL 'MULTISUB'.
           STOP RUN.
       INIT-PARA.
           DISPLAY 'MAIN INIT'.
       END PROGRAM MULTIMAIN.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTISUB.
       PROCEDURE DIVISION.
       MAIN-PARA.
           ENTRY 'MULTISUB-ALT' USING WS-PARM.
           PERFORM INIT-PARA.
           STOP RUN.
       INIT-PARA.
           DISPLAY 'SUB INIT'.
       END PROGRAM MULTISUB.
